Enums/СпособыПогашенияСтоимостиТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыПогашенияСтоимостиТМЦ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСроку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПередаче50</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриСписании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПогашенияСтоимостиТМЦ/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИнвентарныйУчет") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче);
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПоСроку);
		
		// 4D:ERP для Беларуси, Дмитрий, 10.12.2014 10:16:17 
		// , №
		// {
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче50);
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриСписании);
		// }
		// 4D
		
		Если Параметры.ИнвентарныйУчет Тогда
			ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПоНаработке);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("СпособПогашенияСтоимостиБУ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче);
		
		// 4D:ERP для Беларуси, Дмитрий, 10.12.2014 10:16:17 
		// , №
		// {
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче50);
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриСписании);
		// }
		// 4D
		
	КонецЕсли;
	
	Если Параметры.Свойство("СпособПогашенияСтоимостиНУ") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче);
		
		// 4D:ERP для Беларуси, Дмитрий, 10.12.2014 10:16:17 
		// , №
		// {
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриПередаче50);
		ДанныеВыбора.Добавить(Перечисления.СпособыПогашенияСтоимостиТМЦ.ПриСписании);
		// }
		// 4D
		
	КонецЕсли;
	
КонецПроцедуры
